%Data Analysis
x1 = [-3.9847,-3.5549,-1.2401,-0.9780,-0.7932,-2.8531,-2.7605,-3.7287,-3.5414,-2.2692,-3.4549,-3.0752,-3.9934, -0.9780,-1.5799,-1.4885,-0.7431,-0.4221,-1.1186,-2.3462,-1.0826,-3.4196,-1.3193,-0.8367,-0.6579,-2.9683];
x2 = [2.8792,0.7932,1.1882,3.0682,4.2532,0.3271,0.9846,2.7648,2.6588];
x = -5:0.01:5;
d = size(x);
N = d(2);
d = d(1);
y = zeros(1,N);
mu1 = mean(x1); %x1均值
sigma1 = var(x1); %x1标准差
P1 = 0.9; %x1先验概率
mu2 = mean(x2);
sigma2 = var(x2);
P2 = 0.1;
%Classification
figure(1)
p1 = zeros(1,N);
for i = 1:N
    p1(i) = (1/((2*pi)^(d/2)*det(sigma1)^0.5))*exp(-0.5*(x(i)-mu1)*inv(sigma1)*(x(i)-mu1)');
end
plot(x,p1)
hold on
%_________________________________计算类条件概率1并画图_________________________________________
p2 = zeros(1,N);
for i = 1:N
    p2(i) = (1/((2*pi)^(d/2)*det(sigma2)^0.5))*exp(-0.5*(x(i)-mu2)*inv(sigma2)*(x(i)-mu2)');
end
plot(x,p2),legend('P(X|ω1)','P(X|ω2)'),xlabel('x'),ylabel('P')
%_________________________________计算类条件概率2并画图_________________________________________
figure(2)
p_1 = p1*P1./(p1*P1+p2*P2);
p_2 = p2*P2./(p1*P1+p2*P2);
plot(x,p_1)
hold on
plot(x,p_2)
plot([x(577),x(577)],[0,1],'-'),legend('P(ω1|X)','P(ω2|X)','最小错误率分界面'),xlabel('x'),ylabel('P')
%_________________________________计算后验概率并画图___________________________________________
figure(3)
cost1 = 1 * p_2;
cost2 = 6 * p_1;
plot(x,cost1)
hold on
plot(x,cost2),legend('Cost1','Cost2')
hold on
%_________________________________计算损失并画图_______________________________________________
for i  = 1:N
    if p_1(i) <= p_2(i)
        y(i) = -1;
    else
        y(i) = 1;
    end
end
plot([x(642),x(642)],[0,10],'-'),legend('Cost1','Cost2','最小损失分界面'),xlabel('x');
%__________________________________比较后验概率并分类________________________________________